RandyPatterson/ESP8266_5110/ESP8266_Nokia5110.cpp
#include "FontStructs.h"
#include "ESP8266_Nokia5110.h"
#include "ArialNarrow7pt.h"
#include "ComicSans7pt.h"

const FONT_INFO font_array[]={
		arialNarrow_7ptFontInfo,
		comicSansMS_7ptFontInfo
};
//Font 
static const byte ASCII[][5] =
{
		{0x00, 0x00, 0x00, 0x00, 0x00} // 20
		,{0x00, 0x00, 0x5f, 0x00, 0x00} // 21 !
		,{0x00, 0x07, 0x00, 0x07, 0x00} // 22 "
		,{0x14, 0x7f, 0x14, 0x7f, 0x14} // 23 #
		,{0x24, 0x2a, 0x7f, 0x2a, 0x12} // 24 $
		,{0x23, 0x13, 0x08, 0x64, 0x62} // 25 %
		,{0x36, 0x49, 0x55, 0x22, 0x50} // 26 &
		,{0x00, 0x05, 0x03, 0x00, 0x00} // 27 '
		,{0x00, 0x1c, 0x22, 0x41, 0x00} // 28 (
		,{0x00, 0x41, 0x22, 0x1c, 0x00} // 29 )
		,{0x14, 0x08, 0x3e, 0x08, 0x14} // 2a *
		,{0x08, 0x08, 0x3e, 0x08, 0x08} // 2b +
		,{0x00, 0x50, 0x30, 0x00, 0x00} // 2c ,
		,{0x08, 0x08, 0x08, 0x08, 0x08} // 2d -
		,{0x00, 0x60, 0x60, 0x00, 0x00} // 2e .
		,{0x20, 0x10, 0x08, 0x04, 0x02} // 2f /
		,{0x3e, 0x51, 0x49, 0x45, 0x3e} // 30 0
		,{0x00, 0x42, 0x7f, 0x40, 0x00} // 31 1
		,{0x42, 0x61, 0x51, 0x49, 0x46} // 32 2
		,{0x21, 0x41, 0x45, 0x4b, 0x31} // 33 3
		,{0x18, 0x14, 0x12, 0x7f, 0x10} // 34 4
		,{0x27, 0x45, 0x45, 0x45, 0x39} // 35 5
		,{0x3c, 0x4a, 0x49, 0x49, 0x30} // 36 6
		,{0x01, 0x71, 0x09, 0x05, 0x03} // 37 7
		,{0x36, 0x49, 0x49, 0x49, 0x36} // 38 8
		,{0x06, 0x49, 0x49, 0x29, 0x1e} // 39 9
		,{0x00, 0x36, 0x36, 0x00, 0x00} // 3a :
		,{0x00, 0x56, 0x36, 0x00, 0x00} // 3b ;
		,{0x08, 0x14, 0x22, 0x41, 0x00} // 3c <
		,{0x14, 0x14, 0x14, 0x14, 0x14} // 3d =
		,{0x00, 0x41, 0x22, 0x14, 0x08} // 3e >
		,{0x02, 0x01, 0x51, 0x09, 0x06} // 3f ?
		,{0x32, 0x49, 0x79, 0x41, 0x3e} // 40 @
		,{0x7e, 0x11, 0x11, 0x11, 0x7e} // 41 A
		,{0x7f, 0x49, 0x49, 0x49, 0x36} // 42 B
		,{0x3e, 0x41, 0x41, 0x41, 0x22} // 43 C
		,{0x7f, 0x41, 0x41, 0x22, 0x1c} // 44 D
		,{0x7f, 0x49, 0x49, 0x49, 0x41} // 45 E
		,{0x7f, 0x09, 0x09, 0x09, 0x01} // 46 F
		,{0x3e, 0x41, 0x49, 0x49, 0x7a} // 47 G
		,{0x7f, 0x08, 0x08, 0x08, 0x7f} // 48 H
		,{0x00, 0x41, 0x7f, 0x41, 0x00} // 49 I
		,{0x20, 0x40, 0x41, 0x3f, 0x01} // 4a J
		,{0x7f, 0x08, 0x14, 0x22, 0x41} // 4b K
		,{0x7f, 0x40, 0x40, 0x40, 0x40} // 4c L
		,{0x7f, 0x02, 0x0c, 0x02, 0x7f} // 4d M
		,{0x7f, 0x04, 0x08, 0x10, 0x7f} // 4e N
		,{0x3e, 0x41, 0x41, 0x41, 0x3e} // 4f O
		,{0x7f, 0x09, 0x09, 0x09, 0x06} // 50 P
		,{0x3e, 0x41, 0x51, 0x21, 0x5e} // 51 Q
		,{0x7f, 0x09, 0x19, 0x29, 0x46} // 52 R
		,{0x46, 0x49, 0x49, 0x49, 0x31} // 53 S
		,{0x01, 0x01, 0x7f, 0x01, 0x01} // 54 T
		,{0x3f, 0x40, 0x40, 0x40, 0x3f} // 55 U
		,{0x1f, 0x20, 0x40, 0x20, 0x1f} // 56 V
		,{0x3f, 0x40, 0x38, 0x40, 0x3f} // 57 W
		,{0x63, 0x14, 0x08, 0x14, 0x63} // 58 X
		,{0x07, 0x08, 0x70, 0x08, 0x07} // 59 Y
		,{0x61, 0x51, 0x49, 0x45, 0x43} // 5a Z
		,{0x00, 0x7f, 0x41, 0x41, 0x00} // 5b [
		,{0x02, 0x04, 0x08, 0x10, 0x20} // 5c backslash
		,{0x00, 0x41, 0x41, 0x7f, 0x00} // 5d ]
		,{0x04, 0x02, 0x01, 0x02, 0x04} // 5e ^
		,{0x40, 0x40, 0x40, 0x40, 0x40} // 5f _
		,{0x00, 0x01, 0x02, 0x04, 0x00} // 60 `
		,{0x20, 0x54, 0x54, 0x54, 0x78} // 61 a
		,{0x7f, 0x48, 0x44, 0x44, 0x38} // 62 b
		,{0x38, 0x44, 0x44, 0x44, 0x20} // 63 c
		,{0x38, 0x44, 0x44, 0x48, 0x7f} // 64 d
		,{0x38, 0x54, 0x54, 0x54, 0x18} // 65 e
		,{0x08, 0x7e, 0x09, 0x01, 0x02} // 66 f
		,{0x0c, 0x52, 0x52, 0x52, 0x3e} // 67 g
		,{0x7f, 0x08, 0x04, 0x04, 0x78} // 68 h
		,{0x00, 0x44, 0x7d, 0x40, 0x00} // 69 i
		,{0x20, 0x40, 0x44, 0x3d, 0x00} // 6a j
		,{0x7f, 0x10, 0x28, 0x44, 0x00} // 6b k
		,{0x00, 0x41, 0x7f, 0x40, 0x00} // 6c l
		,{0x7c, 0x04, 0x18, 0x04, 0x78} // 6d m
		,{0x7c, 0x08, 0x04, 0x04, 0x78} // 6e n
		,{0x38, 0x44, 0x44, 0x44, 0x38} // 6f o
		,{0x7c, 0x14, 0x14, 0x14, 0x08} // 70 p
		,{0x08, 0x14, 0x14, 0x18, 0x7c} // 71 q
		,{0x7c, 0x08, 0x04, 0x04, 0x08} // 72 r
		,{0x48, 0x54, 0x54, 0x54, 0x20} // 73 s
		,{0x04, 0x3f, 0x44, 0x40, 0x20} // 74 t
		,{0x3c, 0x40, 0x40, 0x20, 0x7c} // 75 u
		,{0x1c, 0x20, 0x40, 0x20, 0x1c} // 76 v
		,{0x3c, 0x40, 0x30, 0x40, 0x3c} // 77 w
		,{0x44, 0x28, 0x10, 0x28, 0x44} // 78 x
		,{0x0c, 0x50, 0x50, 0x50, 0x3c} // 79 y
		,{0x44, 0x64, 0x54, 0x4c, 0x44} // 7a z
		,{0x00, 0x08, 0x36, 0x41, 0x00} // 7b {
		,{0x00, 0x00, 0x7f, 0x00, 0x00} // 7c |
		,{0x00, 0x41, 0x36, 0x08, 0x00} // 7d }
		,{0x10, 0x08, 0x08, 0x10, 0x08} // 7e ~
		,{0x00, 0x06, 0x09, 0x09, 0x06} // 7f
};


ESP8266_Nokia5110::ESP8266_Nokia5110(uint8_t SCLK, uint8_t DIN, uint8_t DC, uint8_t CS, uint8_t RST)
{
	_din = DIN;
	_sclk = SCLK;
	_dc = DC;
	_rst = RST;
	_cs = CS;
	_currentRow=0;
	_currentCol=0;
	_currentFont=font_array[COMIC_SANS_REGULAR_7PT];

}

void ESP8266_Nokia5110::begin(void)
{
	pinMode(_cs,   OUTPUT);
	pinMode(_rst, OUTPUT);
	pinMode(_dc,    OUTPUT);
	pinMode(_din,  OUTPUT);
	pinMode(_sclk,  OUTPUT);
	delay(50);
	digitalWrite(_rst, LOW);
	delay(50);
	digitalWrite(_rst, HIGH);
	delay(50);
	send( LCD_COMMAND, 0x21 );  // LCD Extended Commands.
	send( LCD_COMMAND, 0xBf );  // Set LCD Vop (Contrast). //B1
	send( LCD_COMMAND, 0x04 );  // Set Temp coefficent. //0x04
	send( LCD_COMMAND, 0x14 );  // LCD bias mode 1:48. //0x13
	send( LCD_COMMAND, 0x0C );  // LCD in normal mode. 0x0d for inverse
	send(LCD_COMMAND, 0x20);
	send(LCD_COMMAND, 0x0C);

}

void ESP8266_Nokia5110::write(char character)
{
	send(LCD_DATA, 0x00);//first byte blank
	for (int index = 0; index < 5; index++)
	{//5 bytes for character
		send(LCD_DATA, ASCII[character - 0x20][index]);
	}
	send(LCD_DATA, 0x00);//last byte blank
}

void ESP8266_Nokia5110::writeDynamic(char character)
{
	send(LCD_DATA, 0x00);//first byte blank
	FONT_CHAR_INFO charInfo=_currentFont.descriptor[character - 0x20];
	//Serial.printf("Char-%c, length-%d, offset %d\n", character, charInfo.length, charInfo.offset);
	for (int index = 0; index < charInfo.length; index++)
	{//variable length character
		send(LCD_DATA, _currentFont.characters[charInfo.offset+index]);
	}
}


void ESP8266_Nokia5110::setContrast(uint8_t val) {
	if (val > 0x7f) {
		val = 0x7f;
	}
	send( LCD_COMMAND,0x20 | 0x01 );
	send( LCD_COMMAND, 0x80 | val);
	send( LCD_COMMAND,0x20);

}


// setCursor routine to position cursor
// col - range: 0 to 84
// row - range: 0 to 5
void ESP8266_Nokia5110::setCursor(uint8_t col, uint8_t row)
{
	if (col > LCD_COL) {
		col = LCD_COL;
	}
	_currentCol=col;
	if (row > LCD_ROW) {
		row = LCD_ROW;
	}
	_currentRow=row;
	send( LCD_COMMAND, 0x80 | _currentCol);// col values can be 0 to 83
	send( LCD_COMMAND, 0x40 | _currentRow);// row values can be 0-5

}


void ESP8266_Nokia5110::send(byte dc, byte data)
{
	digitalWrite(_dc, dc);
	digitalWrite(_cs, LOW);
	shiftOut(_din, _sclk, MSBFIRST, data);
	digitalWrite(_cs, HIGH);
}


void ESP8266_Nokia5110::print(String val)
{
	int str_len = val.length() + 1;
	char characters[str_len];
	val.toCharArray(characters,str_len);
	for (int i = 0; i < str_len-1; i++) {
		write(characters[i]);
	}
}

void ESP8266_Nokia5110::printDynamic(String val)
{
	int str_len = val.length() + 1;
	char characters[str_len];
	int spaceCount=0;
	FONT_CHAR_INFO charInfo;
	val.toCharArray(characters,str_len);
	//sweeping the line
	for(int i=0;i<LCD_COL-1;i++){//one less because otherwise the row would be set to next line
		send(LCD_DATA, 0x00);
	}
	if(_alignment==LEFT){
		spaceCount=0;
	}else if(_alignment==CENTER){
		int totalLength=0;
		for (int i = 0; i < str_len-1; i++) {
			charInfo=arialNarrow_7ptDescriptors[characters[i] - 0x20];
			totalLength+=charInfo.length+1;
		}
		if(totalLength<LCD_COL){
			spaceCount=(LCD_COL-totalLength)/2;
		}
	}else if (_alignment==RIGHT){
		int totalLength=0;
		for (int i = 0; i < str_len-1; i++) {
			charInfo=arialNarrow_7ptDescriptors[characters[i] - 0x20];
			totalLength+=charInfo.length+1;
		}
		if(totalLength<LCD_COL){
			spaceCount=(LCD_COL-totalLength);
		}
	}
	//setting start pointer on column
	send( LCD_COMMAND, 0x80 | spaceCount);
	for (int i = 0; i < str_len-1; i++) {
		writeDynamic(characters[i]);
	}
}

void ESP8266_Nokia5110::clear()
{
	for (int index = 0; index < LCD_ROW * LCD_COL / 8; index++)
	{
		send(LCD_DATA, 0x00);
	}
	setCursor(0,0);
}

void ESP8266_Nokia5110::home()
{
	setCursor(0,0);
}

void ESP8266_Nokia5110::setAlignment(FONT_ALIGNMENT alignment){
	_alignment=alignment;
}
void ESP8266_Nokia5110::setFont(FONT font){
	_currentFont=font_array[font];
}
